{
    "AndhraPradesh": "Andhra Pradesh is known for its rich history, culture, and architectural marvels.",
    "ArunachalPradesh": "Arunachal Pradesh is renowned for its picturesque landscapes and diverse tribal cultures.",
    "Assam": "Assam is famous for its tea plantations, wildlife sanctuaries, and traditional dance forms like Bihu.",
    "Bihar": "Bihar is home to ancient civilizations, notable historical sites, and the Ganges River.",
    "Chhattisgarh": "Chhattisgarh is known for its dense forests, waterfalls, and unique tribal traditions.",
    "Goa": "Goa is a popular beach destination, known for its vibrant nightlife and Portuguese heritage.",
    "Gujarat": "Gujarat is famous for its industrial development, rich heritage, and mouthwatering cuisine.",
    "Haryana": "Haryana is renowned for its agricultural prosperity and traditional folk arts.",
    "HimachalPradesh": "Himachal Pradesh is known for its scenic hill stations and adventure tourism.",
    "JammuAndKashmir": "Jammu and Kashmir is known for its breathtaking landscapes, diverse cultures, and handicrafts.",
    "Jharkhand": "Jharkhand is rich in natural resources and cultural diversity with numerous tribal communities.",
    "Karnataka": "Karnataka is home to ancient monuments, modern cities, and the Silicon Valley of India.",
    "Kerala": "Kerala is famous for its backwaters, Ayurveda, and diverse cultural traditions.",
    "MadhyaPradesh": "Madhya Pradesh is known for its historical sites, national parks, and art forms like Gond painting.",
    "Maharashtra": "Maharashtra is the financial hub of India and has a rich cultural heritage.",
    "Manipur": "Manipur is known for its vibrant dance forms like Manipuri and the Loktak Lake.",
    "Meghalaya": "Meghalaya is famous for its living root bridges and lush green landscapes.",
    "Mizoram": "Mizoram is known for its bamboo craft, rich tribal culture, and scenic beauty.",
    "Nagaland": "Nagaland is renowned for its traditional festivals, handlooms, and Naga cuisine.",
    "Odisha": "Odisha is famous for its ancient temples, tribal heritage, and art forms like Odissi dance.",
    "Punjab": "Punjab is known for its agricultural prosperity, vibrant culture, and bhangra dance.",
    "Rajasthan": "Rajasthan is famous for its majestic forts, palaces, and desert landscapes.",
    "Sikkim": "Sikkim is known for its stunning mountains, Buddhist monasteries, and organic agriculture.",
    "TamilNadu": "Tamil Nadu is famous for its classical arts, temples, and vibrant traditions.",
    "Telangana": "Telangana is known for its modern IT industry, rich history, and traditional festivals.",
    "Tripura": "Tripura is renowned for its diverse tribal cultures, palaces, and natural beauty.",
    "UttarPradesh": "Uttar Pradesh is famous for its historical monuments, religious sites, and the Ganges River.",
    "Uttarakhand": "Uttarakhand is known for its scenic hill stations, pilgrimage sites, and adventure tourism.",
    "WestBengal": "West Bengal is famous for its artistic heritage, Durga Puja celebrations, and delicious sweets.",
    "AndamanAndNicobar": "Andaman and Nicobar Islands are known for their pristine beaches, coral reefs, and diverse marine life."
  }
  